;***************************************
;Passive Icons - This file is a fallback file in case a modded item doesn't have the needed strings set
;***************************************
; most of these mod added items have no localisation for the ability the item grants
; my code requires this information to be able to display for the tactical passive
; The original items do however have equipment tactical text for the strategy UI
; Here I copy, adjust and simplify that for my display in tactical
;***************************************
;	IF the original item has the text or is updated in the future to contain the text these localisation get ignored :)
;***************************************
[X2DownloadableContentInfo_WOTCPassiveIcons]

RustyLocName[0]="DEBUG PLACEHOLDER"
RustyLocDesc[0]="This is a default placeholder description. If you are reading this then please contact;\n<Bullet/>The author of the item and tell them they need to update the ability template localization.\n<Bullet/>RustyDios and inform him a Passive Icon from his mod is not displaying a backup localization."

;;[Ability_AshFlameScaleVest X2AbilityTemplate]
;;	original mod X2EquipmentTemplate Localisation
;;	FriendlyName = "Flame Scale Vest"
;;	TacticalText="<bullet/> A lightweight vest that increases soldier health, dodge, and armor, but does not hinder mobility.\n<bullet/> Provides immunity to fire."
RustyLocName[1]="Flame Scale Vest"
RustyLocDesc[1]="<font color = '#FA6942'>*****</font>\nImmunity to fire."

;;[ValentinesVest_Bonus X2AbilityTemplate]
;;	original mod X2EquipmentTemplate Localisation
;;	FriendlyName = "Valentines Vest"
;;	TacticalText="<bullet/> Increases soldier health by 2, mobility by 2, Will by 8.\n<bullet/> Provides immunity to poison."
RustyLocName[2]="Valentines Vest"
RustyLocDesc[2]="<font color = '#FA6942'>*****</font>\nImmunity to poison."

;;[AdventNanoScaleVestBonus X2AbilityTemplate]
;;	original mod X2EquipmentTemplate Localisation
;;	FriendlyName="<font color='#69CA24'>Bio Nanoscale Vest</font>"
;;	TacticalText="<Bullet/> Gives a soldier 2 bonus health.\n<Bullet/> Also, increases armor by 2 and grants Acid Immunity"
RustyLocName[3]="Bio Nano Scale Vest"
RustyLocDesc[3]="<font color = '#FA6942'>*****</font>\nImmunity to to acid."

;;[BioViperScaleVestBonus X2AbilityTemplate]
;;	original mod X2EquipmentTemplate Localisation
;;	FriendlyName="<font color='#69CA24'>Bio Viper Scale Vest</font>"
;;	TacticalText="<bullet/> Increases soldier mobility by 2, and defense by 3.\n<bullet/> Provides immunity to poison, acid and prevents Viper Crush."
RustyLocName[4]="Bio Viper Scale Vest"
RustyLocDesc[4]="<font color = '#FA6942'>*****</font>\nImmunity to acid and poison.\nPrevents viper crush, but not the tongue grab."

;;[AdvancedBioViperScaleVestBonus X2AbilityTemplate]
;;	original mod X2EquipmentTemplate Localisation
;;	FriendlyName="<font color='#69CA24'>Advanced Bio Viper Scale Vest</font>"
;;	TacticalText="<bullet/> Increases soldier health by 1, mobility by 2, and defense by 3.\n<bullet/> Provides immunity to poison, acid, blind and prevents Viper Crush."
RustyLocName[5]="Advanced Bio Viper Scale Vest"
RustyLocDesc[5]="<font color = '#FA6942'>*****</font>\nImmunity to acid, blindness and poison.\nPrevents viper crush, but not the tongue grab."

;;[AdventWraithVestBonus X2AbilityTemplate]
;;	original mod X2EquipmentTemplate Localistion
;;	FriendlyName="Wraith Vest"
;;	TacticalText="<Bullet/> Grants a small boost to soldier health.\n<Bullet/> Grants the Lightning Reflexes and Wall Phasing abilities."
RustyLocName[6]="Wraith Vest"
RustyLocDesc[6]="<font color = '#FA6942'>*****</font>\nImmunity to panic.\nVest also grants wall phasing and lightning reflexes."

;;[ViperFrostVestBonus X2AbilityTemplate]
;;	original mod X2GrenadeTemplate Localisation
;;	FriendlyName="<font color='#13B0E1'>Frost Scale Vest</font>"
;;	TacticalText="<bullet/> Increases soldier health by 2.\n<bullet/> Provides immunity to poison and frost. This vest needs to be equipped in a grenade slot for the Snap Freeze ability to work as intended."
RustyLocName[7]="Frost Scale Vest"
RustyLocDesc[7]="<font color = '#FA6942'>*****</font>\nImmunity to frost and poison."

;***************************************
;Passive Utility Icons inc Mod Items
;***************************************

;;[BioMedikitBonus X2AbilityTemplate]
;;	original mod X2WeaponTemplate Localisation
;;	FriendlyName="<font color='#69CA24'>Biomedikit</font>"
;;	TacticalText="<Bullet/> A Biomedikit can restore <Ability:NANOMEDIKITHEALHP/>HP to a single soldier.\n<Bullet/> Like other Medikits, a Biomedikit can remove negative environmental effects from soldiers and can stabilize soldiers that are bleeding out.\n<Bullet/> Carrying a BioMedikit grants immunity to poison and elerium poisoning and grants 1 additional heal charge.\n<Bullet/> Does not affect robotic allies.\n"
RustyLocName[8]="Bio Medikit"
RustyLocDesc[8]="<font color = '#FA6942'>*****</font>\nImmunity to poison, chryssalid venom and elerium poisoning."

;;[RefractionFieldImmunities X2AbilityTemplate]
;;	original mod source ability localisation
;;	LocLongDescription="Using material recovered from the remains of the alien Spectre, Refraction Field technology will allow the equipped soldier to instantly enter concealment. The Refration Field also grants an immunity to panic when a soldier has one equipped."
;;	~ added new localisation for immunities ability ~
RustyLocName[9]="Refraction Field Immunities"
RustyLocDesc[9]="<font color = '#FA6942'>*****</font>\nImmunity to panic.\nUnit can reconceal."

;;[QueenArmorWallClimb X2AbilityTemplate]
;;	original mod source ability localisation
;;	~ none but the ability icon is 'Vault' and it adds a traversal change ~
RustyLocName[10]="Rend Claw Wall Climb"
RustyLocDesc[10]="<font color = '#FA6942'>*****</font>\nThe rending claws attached to the HIVE Queen armour allow you to scale up walls and cliffs."

;;[WalkerServos X2EquipmentTemplate]
;;	original mod source ability localisation
;;	~ none but the ability icon is 'Vault' and it adds a traversal change ~
RustyLocName[11]="Microstim Implants"
RustyLocDesc[11]="<font color = '#FA6942'>*****</font>\nThe microstim implants allow you to jump up buildings."

;;[PsiVest X2EquipmentTemplate]
;;	original mod source ability localisation
;;	FriendlyName="Phantom Vest"
;;	TacticalText=""<Bullet/> Grants you resistance to all forms of mental impairments such as stun, disorientation and mind control.\n<Bullet/> Grants you HP Regeneration over time.\n<Bullet/> Grants you a small armor bonus."
RustyLocName[12]="Phantom Vest"
RustyLocDesc[12]="<font color = '#FA6942'>*****</font>\nGrants you resistance to all forms of mental impairments such as stun, disorientation and mind control.\nGrants you HP Regeneration over time.\nGrants you a small armor bonus."

;;[xxxx X2EquipmentTemplate]
;;	original mod source ability localisation
;;	FriendlyName=""
;;	TacticalText=""
RustyLocName[13]="Basic Regeneration"
RustyLocDesc[13]="<font color = '#FA6942'>*****</font>\nGrants you HP Regeneration over time."

;;[xxxx X2EquipmentTemplate]
;;	original mod source ability localisation
;;	FriendlyName=""
;;	TacticalText=""
RustyLocName[14]="Advanced Regeneration"
RustyLocDesc[14]="<font color = '#FA6942'>*****</font>\nGrants you HP Regeneration over time."

;;[xxxx X2EquipmentTemplate]
;;	original mod source ability localisation
;;	FriendlyName=""
;;	TacticalText=""
RustyLocName[15]="Superior Regeneration"
RustyLocDesc[15]="<font color = '#FA6942'>*****</font>\nGrants you HP Regeneration over time."

;;[xxxx X2EquipmentTemplate]
;;	original mod source ability localisation
;;	FriendlyName=""
;;	TacticalText=""
RustyLocName[16]="Immunity To Acid"
RustyLocDesc[16]="<font color = '#FA6942'>*****</font>\nGrants you Immunity To Acid."

;;[xxxx X2EquipmentTemplate]
;;	original mod source ability localisation
;;	FriendlyName=""
;;	TacticalText=""
RustyLocName[17]="Immunity To Fire"
RustyLocDesc[17]="<font color = '#FA6942'>*****</font>\nGrants you Immunity To Fire."

;;[xxxx X2EquipmentTemplate]
;;	original mod source ability localisation
;;	FriendlyName=""
;;	TacticalText=""
RustyLocName[18]="Immunity To Poison"
RustyLocDesc[18]="<font color = '#FA6942'>*****</font>\nGrants you Immunity To Poison."

;;[xxxx X2EquipmentTemplate]
;;	original mod source ability localisation
;;	FriendlyName=""
;;	TacticalText=""
RustyLocName[19]="Immunity To Frost"
RustyLocDesc[19]="<font color = '#FA6942'>*****</font>\nGrants you Immunity To Frost."

;;[xxxx X2EquipmentTemplate]
;;	original mod source ability localisation
;;	FriendlyName=""
;;	TacticalText=""
RustyLocName[20]="Immunity To Mental"
RustyLocDesc[20]="<font color = '#FA6942'>*****</font>\nGrants you Immunity To Mental."
